app/Controllers/Carrito.php

SELECT *
FROM `productos`
---
    public function index()
    {
        $model = new ProductModel1();
        $data['productos'] = $model->findAll();